psmon/Arduino/project/samples/akka/esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# The protocol layer uses std::string / std::vector; exceptions stay off (IDF
# default) and the code never throws.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# getaddrinfo() in tcp_stream.cpp needs DNS even when the host is a literal IP.
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# The AMOLED board is an ESP32-S3R8: 8 MB octal PSRAM, 32 MB flash.
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
